examples/flows/compiled/fanout_sequential/flow.mmd
flowchart TD
    %% Flow: multi_stage_flow

    fanin_multi_stage_flow_line_15[fanin_multi_stage_flow_line_15]
    fanin_multi_stage_flow_line_16[fanin_multi_stage_flow_line_16]
    research_agent[research_agent]
    review_agent[review_agent]
    router_multi_stage_flow_line_15_fanout_2{{router_multi_stage_flow_line_15_fanout_2}}
    router_multi_stage_flow_line_16_fanout_1{{router_multi_stage_flow_line_16_fanout_1}}
    start_multi_stage_flow([start_multi_stage_flow])
    summarizer[summarizer]
    __end__((( )))

    start_multi_stage_flow --> router_multi_stage_flow_line_15_fanout_2
    router_multi_stage_flow_line_16_fanout_1 -->|"fanout: p['research']"| fanin_multi_stage_flow_line_16
    fanin_multi_stage_flow_line_16 --> summarizer
    router_multi_stage_flow_line_16_fanout_1 --> review_agent
    review_agent --> fanin_multi_stage_flow_line_16
    router_multi_stage_flow_line_15_fanout_2 -->|"fanout: p['topics']"| fanin_multi_stage_flow_line_15
    fanin_multi_stage_flow_line_15 --> router_multi_stage_flow_line_16_fanout_1
    router_multi_stage_flow_line_15_fanout_2 --> research_agent
    research_agent --> fanin_multi_stage_flow_line_15
    summarizer --> __end__
